-- phpMyAdmin SQL Dump
-- version 4.4.10
-- http://www.phpmyadmin.net
--
-- Host: localhost:3306
-- Generation Time: 2016 年 1 月 11 日 12:02
-- サーバのバージョン： 5.5.42
-- PHP Version: 5.6.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- Database: `sanrentan`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `expectations`
--

CREATE TABLE `expectations` (
  `id` int(11) NOT NULL,
  `race_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `item1` int(11) NOT NULL,
  `item2` int(11) NOT NULL,
  `item3` int(11) NOT NULL,
  `item4` int(11) NOT NULL,
  `item5` int(11) NOT NULL,
  `result` int(11) DEFAULT '0',
  `cancel_flg` int(11) DEFAULT '0',
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `modified` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `expectations`
--

INSERT INTO `expectations` (`id`, `race_id`, `user_id`, `item1`, `item2`, `item3`, `item4`, `item5`, `result`, `cancel_flg`, `created`, `modified`) VALUES
(8, 2, 1, 15, 17, 20, 21, 22, 0, 0, '2016-01-07 15:22:32', '0000-00-00 00:00:00'),
(9, 1, 1, 8, 9, 10, 11, 14, 0, 0, '2016-01-09 13:01:33', '0000-00-00 00:00:00'),
(10, 2, 11, 15, 16, 17, 19, 22, 0, 0, '2016-01-09 13:02:12', '0000-00-00 00:00:00'),
(11, 3, 3, 33, 37, 40, 41, 43, 0, 0, '2016-01-10 04:10:58', '0000-00-00 00:00:00'),
(28, 3, 1, 32, 33, 38, 39, 40, 0, 0, '2016-01-10 11:57:22', '0000-00-00 00:00:00'),
(29, 3, 8, 32, 33, 34, 35, 36, 0, 0, '2016-01-10 14:45:40', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- テーブルの構造 `races`
--

CREATE TABLE `races` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `place` varchar(255) NOT NULL,
  `grade` int(11) DEFAULT NULL,
  `distance` int(11) NOT NULL,
  `type` int(11) NOT NULL,
  `turn` int(11) NOT NULL,
  `note` text,
  `note2` text,
  `note3` text,
  `race_date` timestamp NULL DEFAULT NULL,
  `view_flg` int(11) NOT NULL DEFAULT '0',
  `accepting_flg` int(11) DEFAULT '0',
  `kojiharu_flg` int(11) DEFAULT '0',
  `html_id` int(11) DEFAULT NULL,
  `is_deleted` int(11) NOT NULL DEFAULT '0',
  `created` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `modified` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `races`
--

INSERT INTO `races` (`id`, `name`, `full_name`, `place`, `grade`, `distance`, `type`, `turn`, `note`, `note2`, `note3`, `race_date`, `view_flg`, `accepting_flg`, `kojiharu_flg`, `html_id`, `is_deleted`, `created`, `modified`) VALUES
(1, '中山金杯', '第65回 日刊スポーツ賞中山金杯', '中山11R', 3, 2000, 0, 0, 'サラ系4歳以上 オープン （国際）［指定］ ハンデ', NULL, NULL, '2016-01-05 06:30:00', 1, 0, NULL, 1606010111, 0, '2016-01-05 11:50:56', NULL),
(2, '京都金杯', '第54回 スポーツニッポン賞京都金杯', '京都11R', 3, 1600, 0, 0, 'サラ系4歳以上 オープン （国際） ハンデ', NULL, NULL, '2016-01-05 06:45:00', 1, 0, NULL, 1608010111, 0, '2016-01-05 11:54:38', NULL),
(3, 'シンザン記念', '第50回日刊スポーツ賞シンザン記念', '京都11R', 3, 1600, 0, 0, 'サラ系3歳 オープン （国際）（特指） 別定', NULL, NULL, '2016-01-10 06:45:00', 1, 1, 1, 1608010311, 0, '2016-01-09 13:07:55', NULL),
(4, 'フェアリーステークス', '第32回 フェアリーステークス', '中山11R', 3, 1600, 0, 0, 'サラ系3歳 オープン （国際）牝（特指） 別定', NULL, NULL, '2016-01-11 06:35:00', 1, 1, 0, 1606010411, 0, '2016-01-09 13:10:50', NULL);

-- --------------------------------------------------------

--
-- テーブルの構造 `race_cards`
--

CREATE TABLE `race_cards` (
  `id` int(11) NOT NULL,
  `race_id` int(11) NOT NULL,
  `wk` int(11) NOT NULL,
  `uma` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `sexage` varchar(255) NOT NULL,
  `weight` int(11) NOT NULL,
  `plus` varchar(255) NOT NULL,
  `j_name` varchar(255) NOT NULL,
  `j_weight` varchar(255) NOT NULL,
  `is_deleted` int(11) NOT NULL DEFAULT '0',
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `modified` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `race_cards`
--

INSERT INTO `race_cards` (`id`, `race_id`, `wk`, `uma`, `name`, `sexage`, `weight`, `plus`, `j_name`, `j_weight`, `is_deleted`, `created`, `modified`) VALUES
(1, 1, 1, 1, 'ロンギングダンサー', '牡7', 494, '\r\n(+2) ', '吉田 豊', '53.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(2, 1, 2, 2, 'スピリッツミノル', '牡4', 494, '\r\n(-4) ', '酒井 学', '53.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(3, 1, 3, 3, 'ステラウインド', '牡7', 490, '\r\n(+4) ', '蛯名 正義', '56.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(4, 1, 3, 4, 'ネオリアリズム', '牡5', 496, '\r\n(-4) ', '戸崎 圭太', '55.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(5, 1, 4, 5, 'ヤマカツエース', '牡4', 492, '\r\n(+6) ', '池添 謙一', '56.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(6, 1, 4, 6, 'ブライトエンブレム', '牡4', 492, '\r\n(+4) ', 'C.ルメール', '56.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(7, 1, 5, 7, 'マイネルフロスト', '牡5', 488, '\r\n(+4) ', '松岡 正海', '57.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(8, 1, 5, 8, 'フラアンジェリコ', '牡8', 516, '\r\n(+6) ', '柴山 雄一', '55.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(9, 1, 6, 9, 'ベルーフ', '競走除外 ', 478, '\r\n(-6) ', 'F.ベリー', '56.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(10, 1, 6, 10, 'フルーキー', '牡6', 490, '\r\n(+6) ', 'M.デムーロ', '57.5 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(11, 1, 7, 11, 'メイショウカンパク', '牡9', 484, '\r\n(0) ', '大野 拓弥', '53.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(12, 1, 7, 12, 'バロンドゥフォール', '牡6', 490, '\r\n(+6) ', '横山 典弘', '54.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(13, 1, 8, 13, 'マイネルディーン', '牡7', 464, '\r\n(+20) ', '柴田 大知', '54.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(14, 1, 8, 14, 'ライズトゥフェイム', '牡6', 488, '\r\n(+4) ', '石川 裕紀人', '56.0 ', 0, '2016-01-05 03:09:47', '0000-00-00 00:00:00'),
(15, 2, 1, 1, 'ニンジャ', '牡7', 476, '\r\n(-2) ', '熊沢 重文', '53.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(16, 2, 1, 2, 'バッドボーイ', '牡6', 514, '\r\n(0) ', '幸 英明', '53.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(17, 2, 2, 3, 'シベリアンスパーブ', '牡7', 512, '\r\n(+6) ', '藤岡 康太', '54.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(18, 2, 2, 4, 'ケイティープライド', '牡6', 496, '\r\n(+4) ', '秋山 真一郎', '53.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(19, 2, 3, 5, 'メイショウマンボ', '牝6', 496, '\r\n(+4) ', '武 幸四郎', '55.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(20, 2, 3, 6, 'ミッキーラブソング', '牡5', 468, '\r\n(+4) ', '小牧 太', '54.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(21, 2, 4, 7, 'ウインプリメーラ', '牝6', 452, '\r\n(-2) ', '川田 将雅', '53.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(22, 2, 4, 8, 'エイシンブルズアイ', '牡5', 468, '\r\n(-2) ', '和田 竜二', '56.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(23, 2, 5, 9, 'オメガヴェンデッタ', 'せん5', 514, '\r\n(+8) ', '岩田 康誠', '55.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(24, 2, 5, 10, 'マジェスティハーツ', '牡6', 496, '\r\n(-4) ', '森 一馬', '56.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(25, 2, 6, 11, 'ダイワマッジョーレ', '牡7', 442, '\r\n(+4) ', '松若 風馬', '57.5 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(26, 2, 6, 12, 'エキストラエンド', '牡7', 478, '\r\n(+8) ', '吉田 隼人', '57.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(27, 2, 7, 13, 'マーティンボロ', '牡7', 456, '\r\n(+16) ', 'S.フォーリー', '57.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(28, 2, 7, 14, 'テイエムタイホー', '牡7', 498, '\r\n(-2) ', '浜中 俊', '57.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(29, 2, 8, 15, 'タガノエスプレッソ', '牡4', 454, '\r\n(+12) ', '菱田 裕二', '54.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(30, 2, 8, 16, 'トーセンスターダム', '牡5', 504, '\r\n(+8) ', '武 豊', '57.5 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(31, 2, 8, 17, 'ドリームバスケット', '牡9', 464, '\r\n(-2) ', '川須 栄彦', '52.0 ', 0, '2016-01-05 03:22:41', '0000-00-00 00:00:00'),
(32, 3, 1, 1, 'メイショウシャチ', '牡3', 0, '( - )', '秋山 真一郎', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(33, 3, 1, 2, 'アストラエンブレム', '牡3', 0, '( - )', 'C.ルメール', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(34, 3, 2, 3, 'レオナルド', '牡3', 0, '( - )', '川田 将雅', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(35, 3, 2, 4, 'キングライオン', '牡3', 0, '( - )', '中谷 雄太', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(36, 3, 3, 5, 'レインボーライン', '牡3', 0, '( - )', '幸 英明', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(37, 3, 3, 6, 'ロジクライ', '牡3', 0, '( - )', '浜中 俊', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(38, 3, 4, 7, 'ジュエラー', '牝3', 0, '( - )', 'M.デムーロ', '54.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(39, 3, 4, 8, 'スナークスカイ', '牡3', 0, '( - )', '鮫島 良太', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(40, 3, 5, 9, 'ラルク', '牝3', 0, '( - )', '武 豊', '54.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(41, 3, 5, 10, 'ピースマインド', '牡3', 0, '( - )', '藤岡 康太', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(42, 3, 6, 11, 'ファインニードル', '牡3', 0, '( - )', 'F.ヴェロン', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(43, 3, 6, 12, 'ノーブルマーズ', '牡3', 0, '( - )', '高倉 稜', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(44, 3, 7, 13, 'クリノシャンボール', '牡3', 0, '( - )', '和田 竜二', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(45, 3, 7, 14, 'シゲルノコギリザメ', '牡3', 0, '( - )', '太宰 啓介', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(46, 3, 7, 15, 'ダンツエンペラー', '牡3', 0, '( - )', '酒井 学', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(47, 3, 8, 16, 'ツーエムレジェンド', '牡3', 0, '( - )', '池添 謙一', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(48, 3, 8, 17, 'ドゥーカ', '牡3', 0, '( - )', '松山 弘平', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(49, 3, 8, 18, 'ショウナンアヴィド', '牡3', 0, '( - )', '岩田 康誠', '56.0 ', 0, '2016-01-09 13:08:10', '0000-00-00 00:00:00'),
(50, 4, 1, 1, 'ボーアムルーズ', '牝3', 0, '( - )', '大野 拓弥', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(51, 4, 1, 2, 'ポロス', '牝3', 0, '( - )', '西村 太一', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(52, 4, 2, 3, 'コパノマリーン', '牝3', 0, '( - )', '田中 勝春', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(53, 4, 2, 4, 'ダイワドレッサー', '牝3', 0, '( - )', '三浦 皇成', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(54, 4, 3, 5, 'ダイワダッチェス', '牝3', 0, '( - )', '柴田 善臣', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(55, 4, 3, 6, 'ビービーバーレル', '牝3', 0, '( - )', '石橋 脩', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(56, 4, 4, 7, 'ラシーム', '牝3', 0, '( - )', '勝浦 正樹', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(57, 4, 4, 8, 'フジマサアクトレス', '牝3', 0, '( - )', '吉田 隼人', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(58, 4, 5, 9, 'レッドシルヴィ', '牝3', 0, '( - )', 'L.コントレラス', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(59, 4, 5, 10, 'ラブリーアモン', '牝3', 0, '( - )', '武士沢 友治', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(60, 4, 6, 11, 'シーブリーズラブ', '牝3', 0, '( - )', '横山 典弘', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(61, 4, 6, 12, 'リセエンヌ', '牝3', 0, '( - )', '蛯名 正義', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(62, 4, 7, 13, 'クードラパン', '牝3', 0, '( - )', '田辺 裕信', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(63, 4, 7, 14, 'アルジャンテ', '牝3', 0, '( - )', '戸崎 圭太', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(64, 4, 8, 15, 'ルミナスティアラ', '牝3', 0, '( - )', '内田 博幸', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00'),
(65, 4, 8, 16, 'ハマヒルガオ', '牝3', 0, '( - )', '石川 裕紀人', '54.0 ', 0, '2016-01-09 13:11:02', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- テーブルの構造 `users`
--

CREATE TABLE `users` (
  `id` int(10) unsigned NOT NULL,
  `username` varchar(50) DEFAULT NULL,
  `nickname` varchar(255) NOT NULL,
  `password` varchar(255) DEFAULT NULL,
  `role` varchar(20) DEFAULT NULL,
  `span` varchar(255) DEFAULT NULL,
  `favorite` varchar(255) DEFAULT NULL,
  `message` text,
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `users`
--

INSERT INTO `users` (`id`, `username`, `nickname`, `password`, `role`, `span`, `favorite`, `message`, `created`, `modified`) VALUES
(1, 'yamaoka', '', '$2a$10$RLnPjDZKm/XSyDDgFDiC8e5l.JZg3pe2958GNZlBHp.MkWL5kcecq', 'admin', NULL, NULL, NULL, '2016-01-08 23:44:06', '2016-01-09 21:10:02'),
(2, 'yamaty', '', '$2a$10$.4JuZ7er22PmXPOB7s0jQOoN1JzZ4mZhysGnEmecMRIEeMaZPVdfe', 'admin', NULL, NULL, NULL, '2016-01-09 21:01:03', '2016-01-09 21:01:03'),
(3, 'kojiharu', '', '$2a$10$iIUthrOef7vH2mFfbD.z3e7pLznptFy9MEWWPlQ/5GipSJySI0wUG', 'admin', NULL, NULL, NULL, '2016-01-10 13:05:42', '2016-01-10 13:05:42'),
(7, 'yamap2', 'やまぴー２', '$2a$10$IFn1wQafZ6jaJFnEKuWbxOx/XSVPKQqwmYd7Yed866ZXtJ/VNVCW.', NULL, '１年', 'ディープインパクト', '３連単当てるぞー！', '2016-01-10 23:40:30', '2016-01-10 23:40:30'),
(8, 'yamap3', 'yamap3', '$2a$10$koUPC4j8gr9jKW8gdNaD7OFhNQjETW0g4QnnH4P7wNbCzn7tuCuPK', NULL, '', '', '', '2016-01-10 23:45:14', '2016-01-10 23:45:14'),
(9, 'yamap4', 'やまぴー４', '$2a$10$W14ZIMAfsxUxeFbeWxjcfOJY.PqDE9RC4i5cgJZfeR1Sxp1KSB.hi', NULL, '', 'オルフェーブル', 'こんにちわ', '2016-01-11 09:31:45', '2016-01-11 09:31:45'),
(10, 'yamap5', 'やまぴー5', '$2a$10$TanZm6McIdhxnIhkEsRBLOMuee9IiAuvmCS6OCjAjnSpp1nOFnyqu', NULL, 'test', 'オルフェーブル', 'こんにちわ', '2016-01-11 09:40:28', '2016-01-11 09:40:28'),
(11, 'yamap6', 'yamap6', '$2a$10$Hou8tYAdCfNV8/e84/5VMeLKu8UF2onxlJj98PgSVykISZMe/KvqS', NULL, '', '', '', '2016-01-11 09:44:03', '2016-01-11 09:44:03'),
(12, 'yamap7', 'yamap7', '$2a$10$KO/fQ6GxFvEWyNtfEHjTT.wPa0Oogr9pLr0Y9zQZSzasmReTyxbXK', NULL, '', '', '', '2016-01-11 09:46:11', '2016-01-11 09:46:11'),
(13, 'yamap8', 'yamap8', '$2a$10$zeGKfcVaJopERadkI6YNTO8FnAdBPrD4J65gRo8XKBBHpNxnS1oJm', NULL, '', '', '', '2016-01-11 09:46:54', '2016-01-11 09:46:54'),
(14, 'yamap9', 'yamap9', '$2a$10$YuZkYDeGOdknxUTEhppHquBa06u./1UBpAnRS0qXQcyrN7Af9DeB.', NULL, '', '', '', '2016-01-11 09:49:00', '2016-01-11 09:49:00'),
(15, 'yamap10', 'yamap10', '$2a$10$IuyLX6exJ2/6udhxSY83/eHZZ4X9hiNJbKSxHV9XgkQDGvaXKljF6', NULL, '', '', '', '2016-01-11 09:49:51', '2016-01-11 09:49:51'),
(16, 'yamap11', 'yamap11', '$2a$10$mJeATRGAMjigcVqJf/50cOBbkRhYMXRovkDtF28eQ6KkppoRWjRf2', NULL, '', '', '', '2016-01-11 09:50:16', '2016-01-11 09:50:16'),
(17, 'yamap12', 'yamap12', '$2a$10$xmg/rtUiDQu.1N9rxj/.jObQ.a4lXwicy8v5FLJGeak3IS33zdvTq', NULL, '', '', '', '2016-01-11 09:54:25', '2016-01-11 09:54:25'),
(18, 'yamapa13', 'yamap13', '$2a$10$QiY9T609UeWiFlYjlGgNq.gXc8wKlmfo8YSL9Na7Q1ZnFikDia0oW', NULL, '', '', '', '2016-01-11 09:55:18', '2016-01-11 09:55:18'),
(19, 'yamap14', 'yamap14', '$2a$10$eFHiSQBvd6Pe6A.lRvWiK.qVIZ8qgHm2k5zAKLyNMWMHb9sfiQS0O', NULL, '', '', '', '2016-01-11 09:56:10', '2016-01-11 09:56:10'),
(20, 'yamap15', 'yamap15', '$2a$10$hZ/Mk7HefZoXcEapksGg8uZjiQzSfWg06B0z4GTG1mQBegJBVmfbe', NULL, '', '', '', '2016-01-11 09:57:32', '2016-01-11 09:57:32');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `expectations`
--
ALTER TABLE `expectations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `race_id` (`race_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `race_user_id` (`user_id`,`race_id`) USING BTREE,
  ADD KEY `created` (`created`);

--
-- Indexes for table `races`
--
ALTER TABLE `races`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `race_cards`
--
ALTER TABLE `race_cards`
  ADD PRIMARY KEY (`id`),
  ADD KEY `race_id` (`race_id`),
  ADD KEY `race_id_2` (`race_id`),
  ADD KEY `created` (`created`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `nickname` (`nickname`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `expectations`
--
ALTER TABLE `expectations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=30;
--
-- AUTO_INCREMENT for table `races`
--
ALTER TABLE `races`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `race_cards`
--
ALTER TABLE `race_cards`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=66;
--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=21;